cards = ['За и против', 'Цифры и факты', 'Опытным путём',
         'Обычаи и нравы', 'Разжигание аппетита', 'Образ будущего',
         'Чувственный образ', 'Ценности', 'Отсылка к авторитету', 'В интересах другой стороны', 'Единый фронт',
         'Полный контроль', 'Комплимент', 'Провокация', 'Жалость', 'Аванс', 'Обвинение', 'Угроза', 'Обличение',
         'Давление', 'Накручивание', 'Обесценивание', 'Траектория', 'Ограничение', 'Помощь', 'Очевидность']

src = ['''Метод влияния «За и против»

Покажите собеседнику, какова может быть обратная сторона его решения: какие риски и потери может повлечь выбор либо какую выгоду можно получить, несмотря на имеющиеся сомнения. Важно, чтобы риски и выгоды были реальными и достаточно очевидными. 

Вспомогательные фразы, которые можно использовать:
•	Здесь ты прав, однако, с другой стороны, может случиться так, что…
•	Действительно, это может привести к тому, что… но при этом…
''',
       '''Метод влияния «Цифры и факты»

Предоставьте собеседнику реальные факты, на которые он сможет опираться в своём решении. В качестве них могут выступать результаты исследований, статистика, доказанные концепции, законы и пр. 

Вспомогательные фразы, которые можно использовать:
•	Согласно последним исследованиям… 
•	Статистика показывает, что…
''',
       '''Метод влияния «Опытным путём»

Приведите реальный пример из своего или чужого опыта, как закончилась аналогичная ситуация или к чему привело то или иное решение. Это поможет собеседнику оценить возможные выводы и потери и опереться на чужой опыт при принятии решения. 

Вспомогательные фразы, которые можно использовать:
•	Ты знаешь, у меня недавно была похожая ситуация, когда… и я тогда очень сильно пожалел, что…
•	Кстати… тоже с подобным сталкивался, и благодаря тому, что…
''',
       '''Метод влияния «Обычаи и нравы»

Попробуйте упомянуть существующие в вашем кругу общения, коллективе, компании, регионе, стране обычаи, нормы и правила, чтобы подсказать собеседнику возможный выбор. Важно делать это аккуратно, чтобы это не выглядело манипуляцией. 

Вспомогательные фразы, которые можно использовать:
•	Кстати, учтите, что в нашей стране, как правило, не всегда принято…
•	Согласно давней традиции компании…
''',
       '''Метод влияния «Разжигание аппетита»

Расширьте видение собеседника относительно его возможных выгод и открывающихся перспектив (естественно, не без ваших усилий), чтобы показать ему, что ещё он может получить в будущем. 

Вспомогательные фразы, которые можно использовать:
•	В этом случае ты также сможешь рассчитывать не только на… но и на…
•	А что, если не только… но и?.. Рассматривал ли ты ситуацию с такой позиции? 
''',
       '''Метод влияния «Образ будущего»

Воспользуйтесь методом визуализации и помогите собеседнику нарисовать привлекательный или, наоборот, отталкивающий образ будущего, которое может его ждать, если он согласится с вами или отвергнет ваше предложение. Важно, чтобы образ был максимально приближен к реальности, чтобы собеседнику было легче его принять.

Вспомогательные фразы, которые можно использовать:
•	Просто представь себе, как в результате этого ты…
•	Давай посмотрим, что это может за собой повлечь… (описание будущего собеседника)
''',
       '''Метод влияния «Чувственный образ»

Обратитесь к чувствам и эмоциям собеседника, которые он бы испытал, приняв ваше предложение. Важно передать собеседнику подходящий эмоциональный настрой, который его вдохновит на свершения либо придаст мотивацию не совершить ошибку. 

Вспомогательные фразы, которые можно использовать:
•	Что бы ты почувствовал, если бы?..
''',
       '''Метод влияния «Ценности»

Обратитесь к реально существующим ценностям собеседника, чтобы продемонстрировать ему все выгоды вашего предложения. Важно при этом сделать акцент на конкретных ценностях, как бы невзначай упоминая их. 

Вспомогательные фразы, которые можно использовать:
•	Мне кажется, что с точки зрения комфорта и удобства, тебе стоит…
•	На твоём месте я бы выбрал… как более безопасный вариант…
''',
       '''Метод влияния «Отсылка к авторитету»

Узнайте, кто является авторитетом для вашего собеседника, и помогите собеседнику посмотреть на ситуацию глазами его кумира. При этом важно не давить на собеседника, а дать ему самостоятельно сделать выводы и принять решение.  

Вспомогательные фразы, которые можно использовать:
•	Как ты считаешь, а что бы сделал… окажись он на твоём месте?
•	Когда… в своё время столкнулся с похожей ситуацией, он выбрал…
''',
       '''Метод влияния «В интересах другой стороны»

Покажите вашу готовность играть на стороне собеседника и действовать в том числе и в его интересах.  Для этого важно озвучить, какие встречные уступки или выгоды вы готовы предложить в обмен на удовлетворение ваших условий. 

Вспомогательные фразы, которые можно использовать:
•	Со своей стороны я готов всячески… что позволит тебе…
•	В обмен на это я могу предложить… для того, чтобы ты…
''',
       '''Метод влияния «Единый фронт»

Найдите, с какой общей проблемой вам с собеседником, возможно, придётся столкнуться в ближайшем будущем, если он не примет ваше предложение. Важно, чтобы данная проблема была реальной, а не надуманной, и чтобы предлагаемое вами решение действительно способствовало её устранению.

Вспомогательные фразы, которые можно использовать:
•	В ином случае мы с тобой столкнёмся с тем, что…
•	Это может привести к тому, что… и тогда нам придётся…
''',
       '''Метод влияния «Полный контроль»

Покажите собеседнику, что вы не стремитесь оказать на него давление, а наоборот – доверяете ему самому принимать решение и нести за это ответственность.

Вспомогательные фразы, которые можно использовать:
•	Если ты сам выберешь… то сможешь…
•	Я тебе, конечно, основные моменты озвучил, но решать только тебе и никому больше…
''',
       '''Манипуляция «Комплимент»

Манипулятор намеренно подчёркивает какое-либо ваше качество, чтобы вызвать у вас гордость и иные положительные эмоции в ответ на комплимент и с помощью этого заставить вас сделать то, что ему нужно. Иногда манипулятором здесь также может использоваться тонкая или грубая лесть.

Вспомогательные фразы, которые можно использовать:
•	Ты же профессионал…
•	Лучше тебя никто с этим не справится!
•	Знаю, что ты спокойно относишься к подобного рода вещам и потому сможешь… 
''',
       '''Манипуляция «Провокация»

Манипулятор провоцирует вас на защиту своего статуса и требует, чтобы вы в срочном порядке свой статус публично подтвердили, совершив нужные манипулятору действия. По его логике, если вы посмеете поступить иначе, это уронит вас в глазах манипулятора и других людей.

Вспомогательные фразы, которые можно использовать:
•	Тебе что, слабо что ли?
•	Нет, конечно, если ты такой трус, то можешь отказаться! 
''',
       '''Манипуляция «Жалость»

Манипулятор намеренно давит на жалость, чтобы показать свою несостоятельность и переложить на вас ответственность и необходимость действовать вместо себя. Часто для этого манипулятор также намеренно принижает свои достоинства.

Вспомогательные фразы, которые можно использовать:
•	Ну чего тебе стоит?
•	Если тебе, конечно, меня совсем не жалко, то ты можешь так поступить…
''',
       '''Манипуляция «Аванс»

Манипулятор намекает на наличие некоего долга, который у вас перед ним имеется и который неплохо бы искупить ответными действиями и желательно прямо сейчас. При этом манипулятор действительно мог в чем-то помочь вам до этого, а мог просто приписать вам несуществующую «задолженность».

Вспомогательные фразы, которые можно использовать:
•	На твоём месте я бы себе помог… после всего того, что я для тебя сделал!
•	Я точно помню, ты мне ещё в прошлом месяце обещал, а теперь, значит, отказываешься от своих слов?
''',
       '''Манипуляция «Обвинение»

Манипулятор намекает, что источником всех его бед являетесь исключительно вы и именно поэтому вы должны искупить свою «вину» и незамедлительно дать ему то, что он от вас хочет.

Вспомогательные фразы, которые можно использовать:
•	А я тебе верила! Если бы ты не… тогда все было бы иначе!
•	Я думал, что вы адекватный, а вы…
''',
       '''Манипуляция «Угроза»

Манипулятор намекает на негативное развитие событий, которое возможно в случае, если он не получит от вас желаемого. Угроза может быть как скрытой, так и открытой, когда манипулятор начинает буквально шантажировать вас.

Вспомогательные фразы, которые можно использовать:
•	Или ты поступаешь так, как следует, или пеняй на себя!
•	Ты знаешь, что бывает с людьми, которые?..
''',
       '''Манипуляция «Обличение»

Манипулятор пытается сорвать с вас несуществующую нелицеприятную маску, чтобы вы под угрозой обличения поступили так, как он хочет. При этом зачастую его обличение может не иметь под собой реальных оснований. 

Вспомогательные фразы, которые можно использовать:
•	И это говоришь мне ты? Да на твоём месте я бы…
•	Всё с тобой понятно… Да ты же просто!..
•	Скажи правду, ты же просто…
''',
       '''Манипуляция «Давление»

Манипулятор абсолютно уверен в своей правоте и давит ей на вас: он точно знает, какие действия от вас необходимы, и не считает нужным объяснять вам причину своей уверенности в этом. Нужно просто сделать, и всё! Что тут непонятного?!

Вспомогательные фразы, которые можно использовать:
•	Ты просто обязан так сделать: так все поступают! 
•	Ты непременно должен…
•	Почему ты до сих пор не?.. Это просто немыслимо!
''',
       '''Манипуляция «Накручивание»

Манипулятор пытается сгустить краски и представить ситуацию более трагичной, чем она есть на самом деле. По его мнению, это быстрее поможет вам принять более «правильное» решение.

Вспомогательные фразы, которые можно использовать:
•	Сначала ты меня не послушаешься, а что дальше? Совсем по наклонной пойдёшь?
•	Может, вам ещё дать ключ от квартиры, где деньги лежат? 
''',
       '''Манипуляция «Обесценивание»

Манипулятор старается обесценить ваши чувства, опыт или достижения, чтобы доказать вам вашу несостоятельность и заставить подчиниться своей, более «правильной» воле. 

Вспомогательные фразы, которые можно использовать:
•	Вот только не строй из себя жертву! Ты же специально…
•	Вечно ты все преувеличиваешь! Всё не так плохо, как ты думаешь!
''',
       '''Манипуляция «Траектория»

Манипулятор предлагает вам выбор без выбора, уточняя лишь незначительные детали – для видимости. А вот другой, неподходящий, по его мнению, вариант отметается им по умолчанию.

Вспомогательные фразы, которые можно использовать:
•	Когда мне лучше вам перезвонить – завтра или послезавтра?
•	Вам как удобнее оплатить – наличными или картой? 
''',
       '''Манипуляция «Ограничение»

Манипулятор пытается загнать вас во временные или иные рамки, чтобы увести от взвешенного решения. При этом все его ограничения искусственные, придуманные им же самим, и не существуют в реальности. 

Вспомогательные фразы, которые можно использовать:
•	Осталось совсем немного времени, чтобы успеть купить наш продукт…
•	Есть только один способ это узнать – поступить так, как я предлагаю!
''',
       '''Манипуляция «Помощь»

Манипулятор всем своим видом демонстрирует, как он переживает за ваше положение и результаты, и пытается показать, что он действует исключительно из лучших побуждений и в ваших интересах. Как говорится, это всё ради тебя!

Вспомогательные фразы, которые можно использовать:
•	Да я же тебе только добра желаю!
•	Как ты не понимаешь: я же ради тебя, дурака, стараюсь!
''',
       '''Манипуляция «Очевидность»

Манипулятор делает вид, что вынужден объяснять вам какие-то элементарные вещи, которые всем и так знакомы. Хотя на самом деле это лишь его точка зрения, которая может не разделяться остальными людьми. 

Вспомогательные фразы, которые можно использовать:
•	Всем известно, что…
•	Да что тут думать! И так понятно, что…
•	Ну как ты не понимаешь, что?..
''']
for n, i in enumerate(cards):
    with open(f'cards/{i}.txt', 'w') as f:
        f.write(src[n])
